dominichuggonsonotteo-prog/GridInv3P/MDK_ARM/.pack/Keil/STM32F3xx_DFP.2.1.0/MDK/Boards/ST/STM32303C-EVAL/Common/GLCD_SPI_STM32303C-EVAL.c
/*-----------------------------------------------------------------------------
 * Name:    GLCD_SPI_STM32303C-EVAL.c
 * Purpose: Graphic LCD interface (240x320 pixels) for Graphic LCD with
 *          16-bit interface for STM32303C-EVAL evaluation board
 * Rev.:    1.1.1
 *----------------------------------------------------------------------------*/

/* Copyright (c) 2013 - 2017 ARM LIMITED

   All rights reserved.
   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:
   - Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.
   - Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in the
     documentation and/or other materials provided with the distribution.
   - Neither the name of ARM nor the names of its contributors may be used
     to endorse or promote products derived from this software without
     specific prior written permission.
   *
   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
   AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
   ARE DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDERS AND CONTRIBUTORS BE
   LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
   SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
   INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
   CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
   ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
   POSSIBILITY OF SUCH DAMAGE.
   ---------------------------------------------------------------------------*/

#include <stddef.h>
#include "stm32f3xx.h"                  // Device header
#include "Board_GLCD.h"                 // ::Board Support:Graphic LCD
#include "GLCD_Config.h"                // Keil.STM32303C-EVAL::Board Support:Graphic LCD

/*********************** Hardware specific configuration **********************/

/*--------------- Graphic LCD interface hardware definitions -----------------*/

/* SPI Interface: SPI2
   PINS:
   - CS     = PE0  (GPIO pin)
   - RS     = GND
   - WR/SCK = PF9  (SPI1_SCK)
   - RD     = GND
   - SDO    = PPB14 (SPI1_MISO)
   - SDI    = PB15 (SPI1_MOSI)                                                */

#define PIN_CS      (1 << 0)
//#define PIN_CLK     (1 << 10)
//#define PIN_DAT     (1 << 12)

//#define IN          0x00
//#define OUT         0x01

/* SPI_SR - bit definitions                                                   */
#define RXNE        0x01
#define TXE         0x02
#define BSY         0x80

#define LCD_CS(x)   ((x) ? (GPIOE->BSRR = PIN_CS) : (GPIOE->BSRR = (PIN_CS << 16)));

#define SPI_START   (0x70)              /* Start byte for SPI transfer        */
#define SPI_RD      (0x01)              /* WR bit 1 within start              */
#define SPI_WR      (0x00)              /* WR bit 0 within start              */
#define SPI_DATA    (0x02)              /* RS bit 1 within start byte         */
#define SPI_INDEX   (0x00)              /* RS bit 0 within start byte         */


/************************ Global variables ************************************/

static uint16_t   foreground_color = GLCD_COLOR_BLACK;
static uint16_t   background_color = GLCD_COLOR_WHITE;
static GLCD_FONT *active_font      = NULL;

static uint8_t    Himax;

/************************ Local auxiliary functions ***************************/

/**
  \fn          void delay_ms (uint32_t cnt)
  \brief       Delay in while loop cycles
  \param[in]   cnt   number of while cycles to delay
*/
#define DELAY_2N    8
static void delay_ms (uint32_t cnt) {
  cnt <<= DELAY_2N;
  while (cnt--);
}


#if 0   // not yet coded
/**
  \fn          uint8_t spi_tran_man (uint8_t byte, uint32_t mode)
  \brief       Transfer 1 byte over the serial communication
  \param[in]   byte   byte to be sent
  \param[in]   mode   OUT = transmit byte, IN = receive byte
  \returns     byte read while sending
*/
static uint8_t spi_tran_man (uint8_t byte, uint32_t mode) {
  unsigned char val = 0;
  int i;

  if (mode == OUT) { DAT_MODE (OUT); }
  else             { DAT_MODE (IN);  }

  for (i = 7; i >= 0; i--) {
    LCD_CLK(0);
    delay(1);
    if (mode == OUT) {
      LCD_DAT((byte & (1 << i)) != 0);
    }
    else {
      val |= (BUS_VAL() << i);
    }
    LCD_CLK(1);
    delay(1);
  }
  return (val);
}
#endif


/**
  \fn          uint8_t spi_tran (uint8_t byte)
  \brief       Transfer 1 byte over the serial communication
  \param[in]   byte   byte to be sent
  \returns     byte read while sending
*/
static __inline uint8_t spi_tran (uint8_t byte) {

  *((volatile uint8_t *)&(SPI2->DR)) = byte;     /* 8bit access because of 8 databits  */

  while (!(SPI2->SR & RXNE));           /* Wait for send to finish            */
  return (*((volatile uint8_t *)&(SPI2->DR)));   /* 8bit access because of 8 databits  */
}


/**
  \fn          void wr_cmd (uint8_t cmd)
  \brief       Write a command to the LCD controller
  \param[in]   cmd  Command to write
*/
static __inline void wr_cmd (uint8_t cmd) {
  LCD_CS(0);
  spi_tran(SPI_START | SPI_WR | SPI_INDEX);   /* Write : RS = 0, RW = 0       */
  spi_tran(0);
  spi_tran(cmd);
  LCD_CS(1);
}

/**
  \fn          void wr_dat (uint16_t dat)
  \brief       Write data to the LCD controller
  \param[in]   dat  Data to write
*/
static __inline void wr_dat (uint16_t dat) {
  LCD_CS(0);
  spi_tran(SPI_START | SPI_WR | SPI_DATA);    /* Write : RS = 1, RW = 0       */
  spi_tran((dat >>   8));                     /* Write D8..D15                */
  spi_tran((dat & 0xFF));                     /* Write D0..D7                 */
  LCD_CS(1);
}

/**
  \fn          void wr_dat_start (void)
  \brief       Start writing data to LCD controller
*/
static __inline void wr_dat_start (void) {
  LCD_CS(0);
  spi_tran(SPI_START | SPI_WR | SPI_DATA);    /* Write : RS = 1, RW = 0       */
}

/**
  \fn          void wr_dat_stop (void)
  \brief       Stop writing data to LCD controller
*/
static __inline void wr_dat_stop (void) {
  LCD_CS(1);
}

/**
  \fn          void wr_dat_only (uint16_t dat)
  \brief       Write data to the LCD controller (without start/stop sequence)
  \param[in]   dat  Data to write
*/
static __inline void wr_dat_only (uint16_t dat) {
  spi_tran((dat >>   8));                     /* Write D8..D15                */
  spi_tran((dat & 0xFF));                     /* Write D0..D7                 */
}

/**
  \fn          uint16_t rd_dat (void)
  \brief       Read data from the LCD controller
  \returns     Data read
*/
static __inline uint16_t rd_dat (void) {
  unsigned short val = 0;

