dominichuggonsonotteo-prog/GridInv3P/MDK_ARM/.pack/Keil/STM32F3xx_DFP.2.1.0/MDK/Boards/ST/STM32303C-EVAL/Common/GLCD_SPI_STM32303C-EVAL.c
  LCD_CS(0);
  spi_tran(SPI_START | SPI_RD | SPI_DATA);    /* Read: RS = 1, RW = 1         */
  spi_tran(0);                                /* Dummy read 1                 */
  val   = spi_tran(0);                        /* Read D8..D15                 */
  val <<= 8;
  val  |= spi_tran(0);                        /* Read D0..D7                  */
  LCD_CS(1);
  return (val);
}

/**
  \fn          void wr_reg (uint8_t reg, uint16_t val)
  \brief       Write a value to the LCD register
  \param[in]   reg  Register to be written
  \param[in]   val  Value to write to the register
*/
static __inline void wr_reg (uint8_t reg, uint16_t val) {
  wr_cmd(reg);
  wr_dat(val);
}

/**
  \fn          uint16_t rd_reg (uint8_t reg)
  \brief       Read a value from the LCD register
  \param[in]   reg  Register to be read
  \returns     Value read from the register
*/
static __inline uint16_t rd_reg (uint8_t reg) {
  wr_cmd(reg);
  return (rd_dat());
}


/**
  \fn          void GLCD_SetWindow (uint32_t x, uint32_t y, uint32_t w, uint32_t h)
  \brief       Set draw window region
  \param[in]   x  Horizontal position in pixel
  \param[in]   y  Vertical position in pixel
  \param[in]   w  Window width in pixel
  \param[in]   h  Window height in pixel
*/
static void GLCD_SetWindow (uint32_t x, uint32_t y, uint32_t w, uint32_t h) {
  uint32_t xe, ye;

  if (Himax) {
    xe = x+w-1;
    ye = y+h-1;

    wr_reg(0x02, (uint16_t)(x  >>   8)); /* Column address start MSB          */
    wr_reg(0x03, (uint16_t)(x  & 0xFF)); /* Column address start LSB          */
    wr_reg(0x04, (uint16_t)(xe >>   8)); /* Column address end MSB            */
    wr_reg(0x05, (uint16_t)(xe & 0xFF)); /* Column address end LSB            */

    wr_reg(0x06, (uint16_t)(y  >>   8)); /* Row address start MSB             */
    wr_reg(0x07, (uint16_t)(y  & 0xFF)); /* Row address start LSB             */
    wr_reg(0x08, (uint16_t)(ye >>   8)); /* Row address end MSB               */
    wr_reg(0x09, (uint16_t)(ye & 0xFF)); /* Row address end LSB               */
  }
  else {
  #if (GLCD_SWAP_XY == 1)
    wr_reg(0x50, (uint16_t)(y));        /* Vertical   GRAM Start Address      */
    wr_reg(0x51, (uint16_t)(y+h-1));    /* Vertical   GRAM End   Address (-1) */
    wr_reg(0x52, (uint16_t)(x));        /* Horizontal GRAM Start Address      */
    wr_reg(0x53, (uint16_t)(x+w-1));    /* Horizontal GRAM End   Address (-1) */
    wr_reg(0x20, (uint16_t)(y));
    wr_reg(0x21, (uint16_t)(x));
  #else
    wr_reg(0x50, (uint16_t)(x));        /* Horizontal GRAM Start Address      */
    wr_reg(0x51, (uint16_t)(x+w-1));    /* Horizontal GRAM End   Address (-1) */
    wr_reg(0x52, (uint16_t)(y));        /* Vertical   GRAM Start Address      */
    wr_reg(0x53, (uint16_t)(y+h-1));    /* Vertical   GRAM End   Address (-1) */
    wr_reg(0x20, (uint16_t)(x));
    wr_reg(0x21, (uint16_t)(y));
  #endif
  }
}


#if 0   // not yet tested
/**
  \fn          uint16_t rd_id_man (void)
  \brief       Read LCD controller ID (Himax GLCD)
  \returns     controller ID
*/
static uint16_t rd_id_man (void) {
  unsigned short val;

  /* Set MOSI, MISO and SCK as GPIO pins, with pull-down/pull-up disabled     */
  GPIOC->CRH   &= 0xFFF000FF;
  GPIOC->CRH   |= 0x00033300;

  LCD_CS (1);                           /* Set chip select high               */
  LCD_CLK(1);                           /* Set clock high                     */

  LCD_CS(0);
  spi_tran_man (SPI_START | SPI_WR | SPI_INDEX, OUT);
  spi_tran_man (0x00, OUT);
  LCD_CS(1);

  LCD_CS(0);
  spi_tran_man (SPI_START | SPI_RD | SPI_DATA, OUT);
  val = spi_tran_man(0, IN);
  LCD_CS(1);

  /* Connect MOSI, MISO, and SCK to SSP peripheral                            */
  GPIOC->CRH   &= 0xFFF000FF;
  GPIOC->CRH   |= 0x000B8B00;
  return (val);
}
#endif


/************************ Exported functions **********************************/

/**
  \fn          int32_t GLCD_Initialize (void)
  \brief       Initialize Graphic LCD
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_Initialize (void) {
  uint16_t driverCode;

  /* Enable clock for GPIOB,E,F and SPI2                                      */
  RCC->AHBENR  |= 0x00640000;
  RCC->APB1ENR |= 0x00004000;

  /* NCS is PE0, GPIO output set to high                                      */
  GPIOE->ODR   |=  0x00000001;          /* set Pin to High                    */
  GPIOE->MODER &= ~0x00000003;
  GPIOE->MODER |=  0x00000001;          /* General purpose output mode        */

  /* SPI2_MISO, SPI2_MOSI are SPI pins                                        */
  GPIOB->OSPEEDR |= 0xF0000000;

  GPIOB->MODER  &= ~0xF0000000;
  GPIOB->MODER  |=  0xA0000000;         /* set Alternate Function mode        */
  GPIOB->AFR[1] &= ~0xFF000000;         /* Clear AFIO bits                    */
  GPIOB->AFR[1] |=  0x55000000;

  /* SPI2_SCK is SPI pins                                                     */
  GPIOF->OSPEEDR |= 0x000C0000;

  GPIOF->MODER  &= ~0x000C0000;
  GPIOF->MODER  |=  0x00080000;         /* set Alternate Function mode        */
  GPIOF->AFR[1] &= ~0x000000F0;         /* Clear AFIO bits                    */
  GPIOF->AFR[1] |=  0x00000050;

  /* Enable SPI in Master Mode, CPOL=1, CPHA=1                                */
  /* Max. 18 MBit used for Data Transfer @ 36MHz                              */
  SPI2->CR2     = 0x1700;               /* 8bit data, Fifo level = 1/4        */
  SPI2->CR1     = 0x034F;

  delay_ms(1000);                         /* Delay 50 ms                        */

//  driverCode = rd_id_man ();
  driverCode = 0;
  if (driverCode == 0) {
    driverCode = rd_reg(0x00);
  }

  if (((driverCode & 0xFF) == 0x47) ||  /* LCD with HX8347-D LCD Controller   */
		  ((driverCode & 0xFF) == 0x75)   ){/* LCD with HX8347-G LCD Controller   */
    Himax = 1;                          /* Set Himax LCD controller flag      */
    /* Driving ability settings ----------------------------------------------*/
    wr_reg(0xEA, 0x00);                 /* Power control internal used (1)    */
    wr_reg(0xEB, 0x20);                 /* Power control internal used (2)    */
    wr_reg(0xEC, 0x0C);                 /* Source control internal used (1)   */
    wr_reg(0xED, 0xC7);                 /* Source control internal used (2)   */
    wr_reg(0xE8, 0x38);                 /* Source output period Normal mode   */
    wr_reg(0xE9, 0x10);                 /* Source output period Idle mode     */
    wr_reg(0xF1, 0x01);                 /* RGB 18-bit interface ;0x0110       */
    wr_reg(0xF2, 0x10);

    /* Adjust the Gamma Curve ------------------------------------------------*/
    wr_reg(0x40, 0x01);
    wr_reg(0x41, 0x00);
    wr_reg(0x42, 0x00);
    wr_reg(0x43, 0x10);
    wr_reg(0x44, 0x0E);
    wr_reg(0x45, 0x24);
    wr_reg(0x46, 0x04);
    wr_reg(0x47, 0x50);
    wr_reg(0x48, 0x02);
    wr_reg(0x49, 0x13);
    wr_reg(0x4A, 0x19);
    wr_reg(0x4B, 0x19);
    wr_reg(0x4C, 0x16);

    wr_reg(0x50, 0x1B);
    wr_reg(0x51, 0x31);
    wr_reg(0x52, 0x2F);
    wr_reg(0x53, 0x3F);
    wr_reg(0x54, 0x3F);
    wr_reg(0x55, 0x3E);
    wr_reg(0x56, 0x2F);
    wr_reg(0x57, 0x7B);
    wr_reg(0x58, 0x09);
    wr_reg(0x59, 0x06);
    wr_reg(0x5A, 0x06);
    wr_reg(0x5B, 0x0C);
    wr_reg(0x5C, 0x1D);
    wr_reg(0x5D, 0xCC);

    /* Power voltage setting -------------------------------------------------*/
    wr_reg(0x1B, 0x1B);
    wr_reg(0x1A, 0x01);
    wr_reg(0x24, 0x2F);
    wr_reg(0x25, 0x57);
    wr_reg(0x23, 0x88);

    /* Power on setting ------------------------------------------------------*/
    wr_reg(0x18, 0x36);                 /* Internal oscillator frequency adj  */
    wr_reg(0x19, 0x01);                 /* Enable internal oscillator         */
    wr_reg(0x01, 0x00);                 /* Normal mode, no scrool             */
    wr_reg(0x1F, 0x88);                 /* Power control 6 - DDVDH Off        */
    delay_ms(200);
    wr_reg(0x1F, 0x82);                 /* Power control 6 - Step-up: 3 x VCI */
    delay_ms(50);
    wr_reg(0x1F, 0x92);                 /* Power control 6 - Step-up: On      */
    delay_ms(50);
    wr_reg(0x1F, 0xD2);                 /* Power control 6 - VCOML active     */
    delay_ms(50);

